
&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Объект.Валюта 		= Объект.Договор.Валюта;
	Объект.Контрагент 	= Объект.Договор.Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();  
	ОбновлениеТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновлениеТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеТоваров()
	Для Каждого Товар Из Объект.Товары Цикл
		Товар.Цена = ТоварыНоменклатураПриИзмененииНаСервере(Товар.Номенклатура);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ) КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
	               |	И ЦеныНоменклатурыСрезПоследних.Валюта = &Валюта";     
			   
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Валюта",       	Объект.Валюта);
	Запрос.УстановитьПараметр("Дата",       	Объект.Дата);
 			   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;		
	КонецЦикла;  
	
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Номенклатура 	= Элементы.Товары.ТекущиеДанные.Номенклатура;
	Элементы.Товары.ТекущиеДанные.Цена = ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура);
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;   
	
	Если ПараметрыСеанса.ТекущийПользователь.Роль = Перечисления.Роли.Пользователь Тогда
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;   
	
КонецПроцедуры





