
Процедура ПередЗаписью(Отказ)
	Если УникальныйИдентификатор = "" Тогда
		Пользователь			=	ПользователиИнформационнойБазы.СоздатьПользователя();
	    Пользователь.Имя		=	Наименование;
	    Пользователь.ПолноеИмя	=	Наименование;
		
	    Если КоличествоПользователей() Тогда
	        Пользователь.Роли.Добавить(Метаданные.Роли.Пользователь);
			Роль = Перечисления.Роли.Пользователь;
		Иначе 
			Пользователь.Роли.Добавить(Метаданные.Роли.Администратор);
			Роль = Перечисления.Роли.Администратор;
		КонецЕсли; 
		
	    Пользователь.ПоказыватьВСпискеВыбора = Истина;
	        
	    Пользователь.Записать();
	    УникальныйИдентификатор = Пользователь.УникальныйИдентификатор;
    КонецЕсли;
КонецПроцедуры  


Функция КоличествоПользователей()
	КоличествоПользователей = 0;
	Пользователи = Справочники.Пользователи.Выбрать();
	
	Пока Пользователи.Следующий() Цикл
		КоличествоПользователей = КоличествоПользователей + 1;
	КонецЦикла;
	
	Возврат КоличествоПользователей;
КонецФункции

